Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh340-v2.tmx
Source language: bo
Languages: en

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་བགྲོད་པ་གཅིག་པུའི་ལམ་སྟོན་པ། རྣམ་པ་གཉིས་ཀྱི་ཤེས་བྱ་དང་། ཡེ་ཤེས་ལ་མངའ་བརྙེས་པ། མ་འདྲེས་པའི་དྲན་པ་ཉེ་བར་གཞག་པ་གསུམ་ལ་མཁས་པ། མི་འཇིགས་པ་བཞིས་མི་འཇིགས་པ། འགྲོ་བ་ལྔར་འགྲོ་བ་ལས་རྣམ་པར་གྲོལ་བ། སྐྱེ་མཆེད་དྲུག་ལ་མཁས་པ། བྱང་ཆུབ་ཀྱི་ཡན་ལག་བདུན་ལ་སྤྱོད་ཡུལ་བ། རྣམ་པར་ཐར་པར་བརྒྱད་ལ་བསམ་གཏན་པ། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་ལ་སྙོམས་པར་འཇུག་པ། སྟོབས་བཅུའི་སྟོབས་དང་ལྡན་པ། ཡང་དག་པའི་སེང་གེའི་སྒྲ་ཆེན་པོ་སྒྲོགས་པ་རྣམས་ནི། ཆོས་ཉིད་ཀྱིས་ཉིན་དུས་གསུམ། མཚན་དུས་གསུམ་སྟེ། ཉིན་མཚན་དུས་དྲུག་ཏུ་སངས་རྒྱས་ཀྱི་སྤྱན་གྱིས་འཇིག་རྟེན་ལ་གཟིགས་ཏེ།
en: The blessed buddhas, teachers of the one path to be traversed, with mastery over wisdom and the two types of knowable objects, in command of the three kinds of sterling equanimity, fearless by means of the fourfold fearlessness, freed from migration through the five destinies, keen in the six sense bases, practiced in the seven limbs of enlightenment, focused on the eight liberations, absorbed in the nine successive meditative absorptions, possessing all ten of the ten powers, whose proclamations are the great roaring of a perfect lion, by nature regard the world with their buddha eyes six times throughout the day and night—three times by day and three times by night. These are their thoughts as they look out in wisdom:

source: སུ་ནི་ཉམ་ང་བར་འགྱུར།
en: Who is in a dreadful state?

source: སུ་ནི་ངས་ངན་སོང་ནས་ཕྱུང་སྟེ། མཐོ་རིས་དང་ཐར་པ་དང་། འབྲས་བུ་ལ་གཞག་པར་བྱ།
en: Whom shall I pull up from the lower realms, and establish in the resultant state of heaven and liberation?

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དགོངས་པ་དེད་དཔོན་འདི་ནི། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་སེམས་བསྐྱེད་པར་འགྱུར་རོ་
en: The Blessed One thought, “This trader will pursue unexcelled, total, and complete enlightenment with single-minded resolve.”

source: སྙམ་དུ་དགོངས་ནས་སྔ་དྲོ་ཤམ་ཐབས་དང་ཆོས་གོས་གསོལ་ཏེ
en: With this in mind, in the morning he donned his lower garment and Dharma robes, and,

source: ལྷུང་བཟེད་བསྣམས་ནས་དགེ་སློང་མང་པོས་ཞམ་རིང་བྱས་ཏེ།
en: carrying his alms bowl,

source: སྒོ་དེ་ཉིད་ནས་མཉན་དུ་ཡོད་པའི་ནང་དུ་གཤེགས་པ་དང་།
en: he entered Śrāvastī for alms through that very same gate.

source: དེད་དཔོན་དེས་ཐག་རིང་པོ་ཞིག་ནས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་སྐུ་སྐྱེས་བུ་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་ཀྱིས་ལེགས་པར་བརྒྱན་ཅིང་སྤ་བར་བྱས་པ་མཐོང་ངོ་། །
en: The trader saw the Blessed Buddha from a distance, his body graced and resplendent with the thirty-two signs of great persons.

source: མཐོང་ནས་ཀྱང་དེ་བཅོམ་ལྡན་འདས་ལ་ཤིན་ཏུ་དགའ་བ་སྐྱེས་སོ། །
en: When he saw him he felt a surge of joy toward the Blessed One.

source: དགའ་བ་སྐྱེས་ནས་དེས་རིན་པོ་ཆེ་སྤར་གྱིས་བཏབ་སྟེ། བཅོམ་ལྡན་འདས་ལ་གཏོར་ནས་
en: In his joy he scooped up jewels in his hands and scattered them over the Blessed One,

source: དེ་དག་སངས་རྒྱས་ཀྱི་མཐུས། བཅོམ་ལྡན་འདས་ཀྱི་སྟོང་དུ་ལྡིང་ཁང་ལྟ་བུར་ཆགས་ཏེ་འདུག་ནས་བཅོམ་ལྡན་འདས་གཤེགས་ན་ནི་འགྲོའོ། །
en: and by the power of the Buddha they became like a canopy above the Blessed One, moving when he moved

source: དེ་ནས་དེད་དཔོན་དེས་ཆོ་འཕྲུལ་དེ་ལྟ་བུ་མཐོང་ནས། ལྷག་པར་ཡང་དགའ་བ་སྐྱེས་སོ། །
en: After witnessing such a miracle the trader was especially filled with joy toward the Blessed One.

source: དགའ་བ་སྐྱེས་ནས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་ཕྱག་འཚལ་ཏེ། གསོལ་པ།
en: In such joy he bowed down at the feet of the Blessed One and implored him,

source: ཟླ་བ་གསུམ་གྱི་བར་དུ་བཅོམ་ལྡན་འདས་དགེ་སློང་གི་དགེ་འདུན་དང་བཅས་པའི་ན་བཟའ་དང་། ཞལ་ཟས་དང་། གཟིམས་ཆ་དང་། གདན་དང་སྙུན་གསོས་དང་། སྨན་ཟོང་རྣམས་སྦྱར་བར་འཚལ་ནབཅོམ་ལྡན་འདས་ཀྱིས་བདག་ལ་གནང་བར་མཛད་དུ་གསོལ།
en: “Blessed One, please permit me to provide the Blessed One and the rest of the saṅgha of monks with provisions of clothing, food, bedding, seats, and medicines for the sick for three months.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཅང་མི་གསུང་བས་དེད་དཔོན་དེ་ལ་གནང་ངོ་། །
en: The Blessed One assented to the trader by his silence.

source: དེ་ནས་དེད་དཔོན་དེས་བཅོམ་ལྡན་འདས་ཀྱིས་ཅང་མི་གསུང་བས་གནང་བར་རིག་ནས། རྒྱལ་བུ་རྒྱལ་བྱེད་ཀྱི་ཚལ་དུ་ཡོ་བྱད་ཐམས་ཅད་སྦྱར་ཏེ།
en: Understanding that by his silence the Blessed One had given his assent, the trader supplied the Blessed One and the rest of the saṅgha of monks with all their necessities there in the garden of Prince Jeta.

source: དེས་སངས་རྒྱས་ལ་སོགས་པ་དགེ་སློང་གི་དགེ་འདུན་ལ་ཟླ་བ་གསུམ་གྱི་བར་དུ་ཡོ་བྱད་ཐམས་ཅད་ཀྱིས་བསྙེན་བཀུར་བྱས་ནས།
en: After he had respectfully served them with all their necessities for three months,

source: ཐ་མའི་ཉིན་པར་སངས་རྒྱས་ལ་སོགས་པ་དགེ་སློང་གི་དགེ་འདུན་ལ་ཞལ་ཟས་རོ་བརྒྱ་དང་ལྡན་པ་གསོལ་ནས།
en: on the last day he offered the Buddha and the rest of the saṅgha of monks food of a hundred flavors,

source: དགེ་སློང་གཞན་དག་ལ་ཡང་རེ་རེ་ལ་རས་ཟུང་རེ་ཕུལ་ནས། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སྨོན་ལམ་བཏབ་སྟེ།
en: After that he also offered each of the other monks a set of robes fashioned from cotton, and prayed for unexcelled, total, and complete enlightenment, saying,

source: ཀྱེ་མ་དགེ་བའི་རྩ་བ་འདིས་ན། བདག་འཇིག་རྟེན་ལོང་བ་འདྲེན་པ་མེད་པ་སྟོན་པ་མེད་པར། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིག་པ་དང་ཞབས་སུ་ལྡན་པ། བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་འདུལ་བའི། ཁ་ལོ་སྒྱུར་བ། བླ་ན་མེད་པ། ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་སུ་གྱུར་ཅིག་ཅེས་བྱས་སོ། །
en: “By this root of virtue may I become a protector for the world’s blind who are without a guide, without any guide at all, a tathāgata, an arhat, a totally and completely awakened buddha possessed of insight and perfect conduct, a sugata, a knower of the world, a tamer of persons, a charioteer, an unsurpassed one, a teacher of humans and gods—a blessed buddha.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། དེད་དཔོན་ལེགས་སོ་ལེགས་སོ། །
en: The Blessed One said to the trader, “Very good, trader, very good.

source: མ་འོངས་པའི་དུས་ན་ཁྱོད་འཇིག་རྟེན་ལོང་བ་འདྲེན་པ་མེད་པ་སྟོན་པ་མེད་པར། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིག་པ་དང་ཞབས་སུ་ལྡན་པ། བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་འདུལ་བའི་ཁ་ལོ་སྒྱུར་བ། བླ་ན་མེད་པ་ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་རིན་ཆེན་གཙུག་ཏོར་ཅན་ཞེས་བྱ་བར་འགྱུར་རོ་ཞེས་གསུངས་སོ།། །།
en: Trader, in the future you will be a protector for the world’s blind who are without a guide, without anyone to show them the way, a tathāgata, an arhat, a totally and completely awakened buddha possessed of insight and perfect conduct, a sugata, a knower of the world, a tamer of persons, a charioteer, an unsurpassed one, a teacher of humans and gods—the blessed buddha known as Ratnaśikhin.”

source: ནོར་ཞེས་བྱ་བ་ནི།
en: Wealth

source: གླེང་གཞི་མཉན་དུ་ཡོད་པ་ན་བཞུགས་ཏེ། དེའི་ཚེ་མཉན་དུ་ཡོད་པ་ན་ཁྱིམ་བདག་ཅིག་གནས་པ་དེས་ཐབས་ཟླར་བབ་པ་ལས་ཆུང་མ་བླངས་ནས།
en: When the Blessed One was in Śrāvastī there lived a certain brahmin.

source: དེ་དེ་དང་ལྷན་ཅིག་ཏུ་རྩེ་ཞིང་དགའ་ལ་དགའ་མགུར་སྤྱོད་པ་ལས། ཕྱི་ཞིག་ན་དེའི་ཆུང་མ་ལ་བུ་ཆགས་ནས།
en: When the time came for him to marry he took a wife, and as they enjoyed themselves and coupled, one day his wife conceived.

source: དེ་ཟླ་བ་དགུའམ་བཅུ་ལོན་པ་དང་། བུ་གཟུགས་བཟང་ཞིང་བལྟ་ན་སྡུག་ལ་མཛེས་པ་ཞིག་བཙས་ཏེ།
en: After nine or ten months had passed, she gave birth to a child who was well proportioned, pleasing to the eye, and beautiful.

source: དེ་འོ་མ་དང་ཞོ་དང་མར་དང་ཞུན་མར་དང་མར་གྱི་ཉིང་གུས་བསྐྱེད་བསྲིངས་ནས།
en: They reared him on milk, yogurt, butter, ghee, and milk solids, and he flourished like a lotus in a lake.

source: དེ་གང་གི་ཚེ་ཆེར་སྐྱེས་པ་དེའི་ཚེ་ཡི་གེ་དང་ཁོང་རྩིས་དང་། ཤོད་དགོད་པ་དང་། ལག་རྩིས་དང་དབྱུང་བ་དང་། སྦ་བ་དང་། དགྲམ་པ་དང་། གོས་བརྟག་པ་དང་། ནོར་བུ་བརྟག་པ་དང་། རིན་པོ་ཆེ་བརྟག་པ་དང་། སྤོས་བརྟག་པ་དང་། སྨན་བརྟག་པ་དང་། གླང་པོ་ཆེ་བརྟག་པ་དང་། རྟ་བརྟག་པ་དང་། གོ་མཚོན་བརྟག་པ་ལ་བསླབས་ཏེ།
en: As he grew up he studied letters, tallying, and arithmetic; the study of seals, lending, deposits, and commerce; and the examination of cloth, jewels, gems, incense, medicine, elephants, horses, and arms and armor.

source: དེ་ནས་ཕྱི་ཞིག་ན་དེས་ཟོང་ཁྱེར་ཏེ། རྒྱ་མཚོའི་ནང་དུ་སོང་བ་ལས། རྒྱ་མཚོའི་གྲུ་བོ་ཆེའི་དོན་གྲུབ་ནས་ཕྱིར་འོངས་སོ། །
en: One day he loaded up his wares and set out on the great ocean only to return after completing his voyage.

source: ཁྱིམ་བདག་དེས་ཀྱང་ཁྱིམ་བདག་མགོན་མེད་ཟས་སྦྱིན་ལ་བརྟེན་ནས། བཅོམ་ལྡན་འདས་ཀྱི་བསྟན་པ་ལ་དད་པ་རྙེད་དེ། སྐྱབས་སུ་འགྲོ་བ་དང་། བསླབ་པའི་གཞི་རྣམས་བླངས་སོ། །
en: In the meantime his father, a householder who served the householder Anāthapiṇḍada, found faith in the Blessed One, went for refuge, and took the fundamental precepts.

source: དེ་ནས་ཕྱི་ཞིག་ན་ཁྱིམ་བདག་དེས་སངས་རྒྱས་ལ་སོགས་པ་དགེ་སློང་གི་དགེ་འདུན་ཁྱིམ་དུ་སྤྱན་དྲངས་ཏེ།
en: One day the householder invited the Buddha and the rest of the saṅgha of monks to his house for three months.

source: རང་གི་ལག་ནས་བཟའ་བ་དང་བཅའ་བ་གཙང་མ་བཟང་པོ་མང་པོས་ཚིམ་པར་བྱས་ནས། ཅི་བཞེད་པ་བསྟབས་ཏེ།
en: By his own hand he contented them with many good, wholesome foods, proffering all that they wished,

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཁྱིམ་བདག་དེའི་བསམ་པ་དང་། བག་ལ་ཉལ་དང་། ཁམས་དང་ཤེས་པ་དང་། རང་བཞིན་ཐུགས་སུ་ཆུད་ནས། དེ་དང་འཐུན་པའི་ཆོས་བསྟན་ཏེ།
en: The Blessed One directly apprehended the householder’s thoughts, habitual tendencies, temperament, capacity, and nature, and taught him the Dharma accordingly.

source: དེ་ནས་ཁྱིམ་བདག་དེ་འཁོར་དང་བཅས་པས། སྟན་དེ་ཉིད་ལ་འཁོད་བཞིན་དུ་འཇིག་ཚོགས་ལ་ལྟ་བའི་རིའི་རྩེ་མོ་མཐོན་པོ་ཉི་ཤུ་ཡེ་ཤེས་རྡོ་རྗེས་བཅོམ་ནས། རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་མངོན་སུམ་དུ་བྱས་ཏེ།
en: When he heard it, the householder and his retinue destroyed with the thunderbolt of wisdom the twenty high peaks of the mountain of views concerning the transitory collection, and manifested the resultant state of stream entry right where they sat.

source: དེས་བདེན་པ་མཐོང་ནས་ཡང་དང་ཡང་དུ་རྒྱལ་བུ་རྒྱལ་བྱེད་ཀྱི་ཚལ་དུ་འགྲོ་ཞིང་། བཅོམ་ལྡན་འདས་ལ་ཆོས་ཉན་པར་བྱེད་དོ། །
en: After seeing the truths the householder went again and again to the garden of Prince Jeta to hear the Dharma from the Blessed Buddha.

source: བདག་གི་བུ་ཡང་དང་ཡང་དུ་དྲན་པར་བྱེད་དེ།
en: There, again and again his thoughts turned to his son, and he thought,

source: ཀྱེ་མ་དེ་ཡང་འདིར་འོངས་ཏེ། བཅོམ་ལྡན་འདས་ཀྱི་བསྟན་པ་ལ་དད་པ་རྙེད་པར་གྱུར་ལ། ཆོས་འདི་ལྟ་བུ་དག་ཀྱང་ཐོབ་ན་ཅི་མ་རུང་སྙམ་མོ། །
en: “How nice it would be for him to come here and find faith in the doctrine of the Blessed One, and to receive such teachings as these!”

source: དེ་ནས་ཕྱི་ཞིག་ན་ཁྱིམ་བདག་གི་བུ་དེ་རྒྱ་མཚོའི་གྲུ་བོ་ཆེའི་དོན་གྲུབ་སྟེ།
en: One day the householder’s son completed his voyage and returned.

source: ཕྱིར་འོངས་ནས་དེས་སྐྱེད་མོས་ཚལ་དུ་རྫས་རྣམས་བཞག་ནས། ཕ་མ་གཉིས་བལྟ་བའི་ཕྱིར་ཤིན་ཏུ་རིངས་པར་བདག་གི་ཁྱིམ་དུ་སོང་བ་ལས།
en: Upon his arrival he dropped off all the riches in the garden and hurried home to see his parents,

source: དེའི་ཕ་མ་གཉིས་ཆོས་ཉན་པའི་ཕྱིར་རྒྱལ་བུ་རྒྱལ་བྱེད་ཀྱི་ཚལ་དུ་སོང་ནས།
en: but his parents had gone to the garden of Prince Jeta to listen to the Dharma.

source: ཁྱིམ་བདག་གི་བུ་དེས་ཕ་མ་གཉིས་ཆོས་ཉན་པའི་ཕྱིར། རྒྱལ་བུ་རྒྱལ་བྱེད་ཀྱི་ཚལ་དུ་སོང་ངོ་ཞེས་ཐོས་སོ། །ཐོས་ནས་ཀྱང་དེ་ཡང་རྒྱལ་བུ་རྒྱལ་བྱེད་ཀྱི་ཚལ་དེ་ཉིད་དུ་སོང་སྟེ།
en: When he was told that his parents had gone to the garden of Prince Jeta to listen to the Dharma, the householder’s son went there too.

source: དེ་དེར་ཕྱིན་ནས་བདག་གི་ཕ་མ་གཉིས་བལྟ་བར་བྱའོ་སྙམ་པ་ལས།
en: When he arrived, thinking, “I shall see my parents,”

source: ཁྱིམ་བདག་གི་བུ་དེས་ཕ་མ་གཉིས་ཆོས་ཉན་པའི་ཕྱིར་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་འདུག་པ་མཐོང་ངོ་། །
en: he saw them sitting before the Blessed One listening to the Dharma.

source: མཐོང་ནས་ཀྱང་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ།
en: He approached them, touched his head to the Blessed One’s feet,

source: ཕ་མ་གཉིས་ཀྱི་མགུལ་ནས་འཇུས་ནས་ཆོས་ཉན་པའི་ཕྱིར་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་འདུག་གོ། །
en: embraced his parents, and sat before the Blessed One to listen to the Dharma.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཁྱེའུ་དེའི་མདུན་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སྤྲོ་བ་སྐྱེ་བར་འགྱུར་བའི་གཏམ་བཀའ་སྩལ་ཏོ། །
en: With the boy seated before him, the Blessed One gave a discourse on generating enthusiasm for unexcelled, total, and complete enlightenment,

source: དེ་ནས་དེ་ཐོས་མ་ཐག་ཏུ་ཁྱེའུ་དེ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལ་འདོད་པ་སྐྱེས་སོ། །
en: and as soon as the young man heard it, he felt a strong desire for unexcelled, total, and complete enlightenment.

source: དེ་ནས་ཁྱིམ་བདག་དེ་བཅོམ་ལྡན་འདས་ལས་ཆོས་ཐོས་ནས། བུ་དང་ལྷན་ཅིག་ཏུ་བདག་གི་ཁྱིམ་དུ་སོང་ངོ་། །
en: After they had heard the Dharma from the Blessed One, the householders returned home with their son.

source: དེར་སོང་ནས་དེ་གཉིས་ཀྱིས་བུ་དེ་ལ་སྨྲས་པ། བུ་ཁྱོད་ཀྱིས་རྒྱ་མཚོ་ཆེན་པོའི་ནང་ནས་བདག་ཅག་གཉིས་ལ་ཅི་ཞིག་ཁྱེར་ཏེ་འོངས།
en: When they arrived they asked him, “Child, what did you bring back for us from out upon the great ocean?”

source: ཁྱེའུས་སྨྲས་པ། རིན་པོ་ཆེ་རིན་ཐང་ཆེ་བ་དག་བཙལ་ཏེ་མཆིས་སོ། །
en: “I searched for and found very precious jewels,” replied the young man.

source: ཕ་མ་གཉིས་ཀྱིས་དེ་ལ་སྨྲས་པ། བུ་ཁྱོད་ཀྱིས་ནི་རྒྱ་མཚོའི་ནང་དུ་སོང་ནས་སྡུག་བསྔལ་སྟོང་ཕྲག་གྲངས་མེད་པ་མྱོང་སྟེ། རིན་པོ་ཆེ་ཐ་མལ་པ་དག་ཁྱེར་ཏེ་འོངས་སོ། །
en: “Son, you set out upon the great ocean, undergoing countless thousands of hardships, and the jewels you brought back are very ordinary,” his parents told him.

source: བདག་ཅག་གིས་ནི་འདི་ཉིད་ན་འདུག་བཞིན་དུ། ཚེགས་ཆུང་ངུས་རིན་པོ་ཆེ་རིན་ཐང་ཆེན་པོ་དག་རྙེད་དོ། །
en: “Just sitting here, with little difficulty, the two of us have found very precious jewels.”

source: ཁྱེའུས་སྨྲས་པ། འོ་ན་ཚེགས་ཆུང་ངུས་རྙེད་པའི་རིན་པོ་ཆེ་དག་ཅི་འདྲ་བ་བལྟ་བར་འཚལ་ལོ། །
en: “Well then,” said the young man, “let me see these jewels you found with such little difficulty.”

source: དེ་ནས་ཕ་མ་གཉིས་ཀྱིས་དེ་ལ་བདག་ཅག་ཉིད་ཀྱི་ཡོན་ཏན་རྒྱས་པར་བརྗོད་དོ། །
en: His parents then explained to him in detail all the great virtues they had acquired for themselves,

source: དེ་ནས་དེ་ཐོས་མ་ཐག་ཏུ་ཁྱེའུ་དེ་ལྷག་པར་ཡང་བཅོམ་ལྡན་འདས་ལ་དགའ་བར་གྱུར་ཏོ། །
en: and when he heard about them the young man was especially filled with joy toward the Blessed One.

source: དགའ་བར་གྱུར་ནས་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས།
en: In his joy he approached the Blessed One,

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེའི་རྐྱེན་དུ་འཚམ་པའི་ཆོས་བསྟན་ཏོ། །
en: The Blessed One taught him the Dharma particularly suited to his condition.

source: བཅོམ་ལྡན་འདས་ཀྱི་གཏམ་གྱི་མཇུག་རྫོགས་པར་རིག་ནས། སྟན་ལས་ལངས་ཏེ།
en: Then the householder’s son, knowing the Blessed One had completed his discourse, rose from his seat,

source: ཟླ་བ་གསུམ་གྱི་བར་དུ་བཅོམ་ལྡན་འདས་དགེ་སློང་གི་དགེ་འདུན་དང་བཅས་པའི་ན་བཟའ་དང་། ཞལ་ཟས་དང་། གཟིམས་ཆ་དང་། གདན་དང་། སྙུན་གསོས་དང་། སྨན་ཟོང་རྣམས་སྦྱར་བར་འཚལ་ན
en: “I would like to provide the Blessed One and the rest of the saṅgha of monks for three months with provisions of clothing, food, bedding, seats, and medicines for the sick.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཁྱིམ་བདག་གི་བུ་དེ་ལ་ཅང་མི་གསུང་བས་གནང་ངོ་། །
en: The Blessed One assented to the householder’s son by his silence.

source: དེ་ནས་ཁྱིམ་བདག་གི་བུ་དེས་བཅོམ་ལྡན་འདས་ཀྱིས་ཅང་མི་གསུང་བས་གནང་བར་རིག་ནས། རྒྱལ་བུ་རྒྱལ་བྱེད་ཀྱི་ཚལ་དུ་ཡོ་བྱད་ཐམས་ཅད་སྦྱར་ཏེ།
en: Understanding that by his silence the Blessed One had given his assent, the householder’s son then supplied the Blessed One and the rest of the saṅgha of monks with all their necessities there in the garden of Prince Jeta.

source: སངས་རྒྱས་ལ་སོགས་པ་དགེ་སློང་གི་དགེ་འདུན་ལ་ཟླ་བ་གསུམ་གྱི་བར་དུ་ཡོ་བྱད་ཐམས་ཅད་ཀྱིས་བསྙེན་བཀུར་བྱས་ནས། ཐ་མའི་ཉིན་པར་སངས་རྒྱས་ལ་སོགས་པ་དགེ་སློང་གི་དགེ་འདུན་ལ་ཞལ་ཟས་རོ་བརྒྱ་དང་ལྡན་པ་གསོལ་ནས།
en: After he had respectfully served them with all their necessities for three months, on the last day he offered the Buddha and the rest of the saṅgha of monks food of a hundred flavors,

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཁྱེའུ་དེ་ལ་བཀའ་སྩལ་པ།
en: The Blessed One said to the householders’ son,

source: ཁྱིམ་བདག་གི་བུ་ལེགས་སོ་ལེགས་སོ། །
en: “Very good, householders’ son, very good.

source: མ་འོངས་པའི་དུས་ན་ཁྱོད་འཇིག་རྟེན་ལོང་བ་འདྲེན་པ་མེད་པ་སྟོན་པ་མེད་པར། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིག་པ་དང་ཞབས་སུ་ལྡན་པ། བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་འདུལ་བའི་ཁ་ལོ་སྒྱུར་བ། བླ་ན་མེད་པ་ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཆུ་རླབས་ཞེས་བྱ་བར་འགྱུར་རོ་ཞེས་གསུངས་སོ།། །།
en: Householders’ son, in the future you will be a protector for the world’s blind who are without a guide, a tathāgata, an arhat, a totally and completely awakened buddha possessed of insight and perfect conduct, a sugata, a knower of the world, a tamer of persons, a charioteer, an unsurpassed one, a teacher of humans and gods—the blessed buddha known as Jalataraṅga.”

source: སྟོབས་ཕྲོག་ཅེས་བྱ་བ་ནི།
en: The Story of Vijaya

source: གླེང་གཞི་མཉན་དུ་ཡོད་པ་ན་བཞུགས་ཏེ། དེའི་ཚེ་བྱང་ཕྱོགས་ཀྱི་པན་ཙ་ལའི་རྒྱལ་པོ་དང་། ལྷོ་ཕྱོགས་ཀྱི་པན་ཙ་ལའི་རྒྱལ་པོ་གཉིས་ཕན་ཚུན་མི་འཐུན་པར་གྱུར་ཏེ།
en: When the Blessed One was in Rājagṛha, the king of North Pañcāla and the king of South Pañcāla did not get along,

source: དུས་དུས་སུ་སྐྱེ་བོ་ཕལ་པོ་ཆེ་ཁ་འདོག་པར་བྱེད་དོ། །
en: and from time to time a great many people were killed.

source: དེ་གཉིས་ཀྱི་མཛའ་བོ་བཤེས་ཤིང་གཅུགས་པ་ནི། རྒྱལ་པོ་གསལ་རྒྱལ་ཡིན་ཏེ། རྒྱལ་པོ་གསལ་རྒྱལ་གྱིས་བསམས་པ།
en: King Prasenajit was a beloved friend of both, and he thought,

source: བདག་གིས་ཐབས་ཅི་ལྟ་བུ་ཞིག་གིས་དེ་གཉིས་བསྡུམ་པར་བྱ་སྙམ་ནས།
en: “How can I reconcile these two?”

source: བཅོམ་ལྡན་འདས་ནི་མ་དུལ་བ་དུལ་བ་ཡིན་ན།
en: “The Blessed One tames those who have not been tamed.

source: མ་ལ་བདག་གིས་བཅོམ་ལྡན་འདས་ལ་གསོལ་བ་གདབ་བོ་སྙམ་ནས།
en: I will put this request before the Blessed One.”

source: བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་སྟེ་
en: King Prasenajit went to see the Blessed One,

source: ཕྱིན་ནས། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་ཕྱག་འཚལ་ཏེ།
en: and upon his arrival he bowed down at the Blessed One’s feet

source: ཕྱོགས་གཅིག་ཏུ་འདུག་ནས།
en: and took a seat at one side.

source: བཅོམ་ལྡན་འདས་ལ་རྒྱལ་པོ་གསལ་རྒྱལ་གྱིས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: Then he put this request to the Blessed One:

source: བཙུན་པ་བྱང་ཕྱོགས་ཀྱི་པན་ཙ་ལའི་རྒྱལ་པོ་དང་། ལྷོ་ཕྱོགས་ཀྱི་པན་ཙ་ལའི་རྒྱལ་པོ་གཉིས་ཕན་ཚུན་མི་འཐུན་པར་གྱུར་ཏེ།
en: “Lord, the king of North Pañcāla and the king of South Pañcāla do not get along,

source: དེ་གཉིས་ཀྱིས་དུས་དུས་སུ་སྐྱེ་བོ་ཕལ་པོ་ཆེ་ཁ་འདོག་པར་བགྱིད་དོ། །
en: and from time to time a great many people are killed.

source: བཅོམ་ལྡན་འདས་ནི་མ་དུལ་བ་དུལ་བ་ལགས་ན་ཐུགས་བརྩེ་བའི་སླད་དུ། དེ་གཉིས་ཀྱི་ཁོན་སྦྱང་བའི་སླད་དུ་ནན་ཏན་མཛད་དུ་གསོལ།
en: Since the Blessed One tames those who have not been tamed, I beseech you, out of compassion for them, please strive to purge them of enmity.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་རྒྱལ་པོ་གསལ་རྒྱལ་ལ་ཅང་མི་གསུང་བས་གནང་ངོ་། །
en: The Blessed One assented to King Prasenajit by his silence.

source: དེ་ནས་རྒྱལ་པོ་གསལ་རྒྱལ་བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པ་ལ་མངོན་པར་བསྟོད་དེ།
en: King Prasenajit then praised this assurance from the Blessed One,

source: རྗེས་སུ་ཡི་རངས་ནས།
en: rejoiced,

source: བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ་བཅོམ་ལྡན་འདས་ཀྱི་ཐད་ནས་སོང་ངོ་། །
en: touched his head to the Blessed One’s feet, and took leave of him.

source: དེ་ནས་བཅོམ་ལྡན་འདས་རྒྱལ་བུ་རྒྱལ་བྱེད་ཀྱི་ཚལ་ནས་མི་སྣང་བར་གྱུར་ཏེ། བྱང་ཕྱོགས་ཀྱི་ཡུལ་པན་ཙ་ལ་དང་། ལྷོ་ཕྱོགས་ཀྱི་ཡུལ་པན་ཙ་ལ་གཉིས་ཀྱི་བར་མཚམས་སུ་གཤེགས་ཏེ་བཞུགས་ནས།
en: The Blessed One disappeared from the garden of Prince Jeta and traveled to the border between North and South Pañcāla,

source: བཅོམ་ལྡན་འདས་ཀྱིས་ཅི་ནས་དེ་དག་འཐབ་པར་སེམས་པ་དེ་ལྟ་བུར་བྱིན་གྱིས་བརླབས་སོ། །
en: where he performed a miracle that caused the kings to feel ineluctably compelled to battle.

source: དེ་ནས་བྱང་ཕྱོགས་ཀྱི་པན་ཙ་ལའི་རྒྱལ་པོ་དང་། ལྷོ་ཕྱོགས་ཀྱི་པན་ཙ་ལའི་རྒྱལ་པོ་གཉིས་ཀྱིས་དཔུང་གི་ཚོགས་ཡན་ལག་བཞི་གོ་བསྐོན་ནས་གཡུལ་འགྱེད་པའི་ཕྱིར། སོ་སོ་ནས་དྲངས་སོ། །
en: So the king of North Pañcāla and the king of South Pañcāla arrayed the four divisions of their armies and set out to wage war.

source: དེ་དག་གཡུལ་འགྱེད་པར་བརྩམས་པ་ལས། སངས་རྒྱས་ཀྱི་མཐུས་དེ་གཉི་གས་རང་རང་ཕམ་སྟེ་མ་ནུས་ནས།
en: As they began waging war, due to the power of the Blessed One neither was able to win.

source: གཞན་གྱིས་ཐུབ་པར་མཐོང་སྟེ། དེ་གཉིས་སོ་སོ་ནས་ཤིང་རྟ་རེ་རེ་ལ་ཞོན་ཏེ། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས།
en: Each had the perception that the other would defeat him, so they both mounted their chariots and went to see the Blessed One.

source: ཕྱོགས་གཅིག་ཏུ་འཁོད་དོ། །
en: and took seats to one side.

source: བཅོམ་ལྡན་འདས་ཀྱིས་ཀྱང་ཅི་ནས་དེ་གཉིས་གཅིག་གིས་གཅིག་མི་མཐོང་བར་བྱིན་གྱིས་བརླབས་ཏེ།
en: The Blessed One performed a miracle so that neither could see the other, and thought,

source: བཅོམ་ལྡན་འདས་ཀྱིས་དགོངས་པ་འདི་གཉིས་ལས་གཅིག་ནི་ངའི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་ནས། ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ཏེ། དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱེད་པར་འགྱུར་རོ། །
en: “Of these two, one will go forth in my very doctrine, cast away all afflictive emotions, and manifest arhatship.

source: གཅིག་གིས་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་སེམས་བསྐྱེད་པར་འགྱུར་རོ་སྙམ་དུ་དགོངས་ནས།
en: The other will pursue unexcelled, total, and complete enlightenment with single-minded resolve.”

source: གཅིག་ལ་ནི་འཕགས་པའི་བདེན་པ་བཞིའི་གཏམ་གསུངས་སོ། །
en: To the first he gave a discourse on the four truths of noble beings.

source: གཅིག་ལ་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལ་སྤྲོ་བར་འགྱུར་བའི་གཏམ་གསུངས་སོ། །
en: To the other he gave a discourse that would spur him on to unexcelled, total, and complete enlightenment.

source: དེ་ནས་ལྷོ་ཕྱོགས་ཀྱི་པན་ཙ་ལའི་རྒྱལ་པོ་སྟན་ལས་ལངས་ཏེ།
en: Thereupon the king of South Pañcāla rose from his seat,

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དགེ་སློང་ཚུར་ཤོག་ཅེས་བྱ་བའི་ཚིག་གིས་རབ་ཏུ་ཕྱུང་སྟེ། བསྙེན་པར་རྫོགས་པར་མཛད་ནས། དེ་ལ་ལུང་ཡང་ཕོག་སྟེ།
en: With the words “Come, join me, monk!” the Blessed One led him to go forth as a novice, conferred on him full ordination, and instructed him.

source: དེས་ཀྱང་བརྩོན་པ་དང་བསྒྲུབ་པ་དང་འབད་པས་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ཏེ། དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱས་སོ། །
en: Casting away all afflictive emotions through diligence, practice, and effort, he manifested arhatship.

source: བྱང་ཕྱོགས་ཀྱི་པན་ཙ་ལའི་རྒྱལ་པོ་ཡང་སྟན་ལས་ལངས་ཏེ།
en: Then the king of North Pañcāla rose from his seat,

source: ཟླ་བ་གསུམ་གྱི་བར་དུ་བཅོམ་ལྡན་འདས་དགེ་སློང་གི་དགེ་འདུན་དང་བཅས་པའི་ན་བཟའ་དང་། ཞལ་ཟས་དང་གཟིམས་ཆ་དང་། གདན་དང་། སྙུན་གསོས་དང་། སྨན་ཟོང་རྣམས་སྦྱར་བར་འཚལ་ན
en: “For three months I would like to provide the Blessed One and the rest of the saṅgha of monks with provisions of clothing, food, bedding, seats, and medicines for the sick.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཕྱོགས་ཀྱི་པན་ཙ་ལའི་རྒྱལ་པོ་ལ་ཡང་ཅང་མི་གསུང་བས་གནང་ངོ་། །
en: The Blessed One assented to the king of North Pañcāla by his silence.

source: དེ་ནས་བྱང་ཕྱོགས་ཀྱི་པན་ཙ་ལའི་རྒྱལ་པོས། བཅོམ་ལྡན་འདས་ཀྱིས་ཅང་མི་གསུང་བས་གནང་བར་རིག་ནས། སངས་རྒྱས་ལ་སོགས་པ་དགེ་སློང་གི་དགེ་འདུན་རང་གི་ཡུལ་དུ་སྤྱན་དྲངས་ཏེ།
en: Understanding that by his silence the Blessed One had given his assent, the king of North Pañcāla then invited the Buddha and the rest of the saṅgha of monks to his own country.

source: སངས་རྒྱས་ལ་སོགས་པ་དགེ་སློང་གི་དགེ་འདུན་ལ་ཟླ་བ་གསུམ་གྱི་བར་དུ་ཡོ་བྱད་ཐམས་ཅད་སྦྱར་ནས། ཡོ་བྱད་ཐམས་ཅད་ཀྱིས་བསྙེན་བཀུར་བྱས་ཏེ།
en: There he respectfully served the Blessed One and the rest of the saṅgha of monks with all their necessities for three months.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་པན་ཙ་ལའི་རྒྱལ་པོ་དེ་ལ་བཀའ་སྩལ་པ། རྒྱལ་པོ་ཆེན་པོ་ལེགས་སོ་ལེགས་སོ། །
en: The Blessed One said to the king of North Pañcāla, “Very good, great king, very good.

source: མ་འོངས་པའི་དུས་ན་རྒྱལ་པོ་ཆེན་པོ་ཁྱོད་འཇིག་རྟེན་ལོང་བ་འདྲེན་པ་མེད་པ་སྟོན་པ་མེད་པར། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིག་པ་དང་ཞབས་སུ་ལྡན་པ། བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་འདུལ་བའི་ཁ་ལོ་སྒྱུར་བ། བླ་ན་མེད་པ་ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམ་པར་རྒྱལ་བ་ཞེས་བྱ་བར་འགྱུར་རོ་ཞེས་གསུངས་སོ། །
en: Great king, in the future you will be a protector for the world’s blind who are without a guide, a tathāgata, an arhat, a totally and completely awakened buddha possessed of insight and perfect conduct, a sugata, a knower of the world, a tamer of persons, a charioteer, an unsurpassed one, a teacher of humans and gods—the blessed buddha known as Vijaya .”

source: ལས་བརྒྱ་ཐམ་པ་ལས། སྡོམ་གྱི་ཚིགས་སུ་བཅད་པ་བརྒྱད་པ་རྫོགས་སོ།། །།
en: This concludes Part Eight of The Hundred Deeds.
